; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-99)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b10)
    (on b10 b25)
    (on b25 b1)
    (on b1 b13)
    (on-table b13)
    (clear b27)
    (on b27 b7)
    (on b7 b4)
    (on b4 b18)
    (on b18 b3)
    (on b3 b9)
    (on b9 b17)
    (on b17 b11)
    (on b11 b12)
    (on b12 b28)
    (on-table b28)
    (clear b26)
    (on b26 b5)
    (on b5 b22)
    (on b22 b24)
    (on-table b24)
    (clear b23)
    (on b23 b16)
    (on b16 b6)
    (on b6 b21)
    (on b21 b8)
    (on b8 b15)
    (on-table b15)
    (clear b20)
    (on b20 b29)
    (on b29 b2)
    (on b2 b19)
    (on-table b19))
 (:goal (and 
(on-table b5)
(on-table b6)
(on b8 b5)
(on b16 b6)
(on b19 b16)
(on b27 b8)
))
)

; plan
1. (unstack b23 b16)
   deleted: (on b23 b16) (clear b23) (arm-empty)
   added: (holding b23) (clear b16)
   goals met: 1 of 6
2. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 1 of 6
3. (unstack b16 b6)
   deleted: (on b16 b6) (clear b16) (arm-empty)
   added: (holding b16) (clear b6)
   goals met: 0 of 6
4. (stack b16 b14)
   deleted: (clear b14) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b14)
   goals met: 0 of 6
5. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 0 of 6
6. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 6
7. (unstack b16 b14)
   deleted: (on b16 b14) (clear b16) (arm-empty)
   added: (holding b16) (clear b14)
   goals met: 1 of 6
8. (stack b16 b6)
   deleted: (clear b6) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b6)
   goals met: 2 of 6
9. (unstack b26 b5)
   deleted: (on b26 b5) (clear b26) (arm-empty)
   added: (holding b26) (clear b5)
   goals met: 2 of 6
10. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 6
11. (unstack b5 b22)
   deleted: (on b5 b22) (clear b5) (arm-empty)
   added: (holding b5) (clear b22)
   goals met: 2 of 6
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 6
13. (unstack b21 b8)
   deleted: (on b21 b8) (clear b21) (arm-empty)
   added: (holding b21) (clear b8)
   goals met: 3 of 6
14. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 6
15. (unstack b8 b15)
   deleted: (on b8 b15) (clear b8) (arm-empty)
   added: (holding b8) (clear b15)
   goals met: 3 of 6
16. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 4 of 6
17. (unstack b27 b7)
   deleted: (on b27 b7) (clear b27) (arm-empty)
   added: (holding b27) (clear b7)
   goals met: 4 of 6
18. (stack b27 b8)
   deleted: (clear b8) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b8)
   goals met: 5 of 6
19. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 5 of 6
20. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 5 of 6
21. (unstack b29 b2)
   deleted: (on b29 b2) (clear b29) (arm-empty)
   added: (holding b29) (clear b2)
   goals met: 5 of 6
22. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 5 of 6
23. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 5 of 6
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 6
25. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 5 of 6
26. (stack b19 b16)
   deleted: (clear b16) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b16)
   goals met: 6 of 6
